Repository: krisztianmukli/bash3boilerplate
Catalog: locale/*/LC_MESSAGES/genlocale.po
Languages: hu

source: Available arguments: -b --bash Use BASH built-in localization, otherwise use gettext. -f --file [arg] Filename to process. Required. -u --update Only update locale files -l --locale [langs] Language code list of generated locale files (comma or space separated) -v Enable verbose mode, print script as it is executed -d --debug Enables debug mode -h --help This page -n --no-color Disable color output -V --version Display version and license information
hu: Használható argumentumok: -b --bash A BASH beépített lokalizációs funkcióját használja, a gettext.sh helyett. -f --file [arg] Feldolgozandó fájlnév. Kötelező. -u --update Csak frissíti a meglévő lokalizációs fájlokat -l --locale [langs] A generálandó nyelvi fájlok nyelvi kódjainak listája (vesszővel, vagy szóközzel elválasztva) -v Részletes mód engedélyezése, kiíratja a szkriptet futás közben -d --debug Hibakeresési mód engedélyezése -h --help Súgó -n --no-color Színes kimenet kikapcsolása -V --version Verzió és licencinformációk megjelenítése

source: This file can generate or update localization files for a bash script
hu: Nyelvi fájlokat generál egy szkripthez vagy frissíti egy szkript meglévő nyelvi fájljait

source: Default
hu: Alapértelmezett

source: Required
hu: Kötelező

source: Generate locale
hu: Lokalizációs fájlok generálása

source: Licensed under the MIT license
hu: MIT licenc alatt kiadva

source: Cannot create locale folder!
hu: Nem lehet létrehozni a locale mappát!

source: Update locale failed: ${folder}/locale/${loc}/LC_MESSAGES/${script}.po!
hu: Lokalizációs fájlok frissítése sikertelen: ${folder}/locale/${loc}/LC_MESSAGES/${script}.po!

source: Update locale success
hu: Lokalizációs fájlok frissítése sikeres

source: Create directory failed: ${folder}/locale/${loc}/LC_MESSAGES!
hu: Könyvtár létrehozása sikertelen: ${folder}/locale/${loc}/LC_MESSAGES!

source: Copy locale failed!
hu: Lokalizációs fájlok másolása sikertelen!

source: Generate locale success
hu: Lokalizációs fájlok létrehozása sikeres

source: Invalid use of script: ${__gl_tmp_params}
hu: Szkript érvénytelen használata: ${__gl_tmp_params}

source: Help using ${__gl_base}
hu: ${__gl_base} súgó

source: Setting a filename with -f or --file is required
hu: Fájlnév megadása a -f vagy --file kapcsolóval szükséges

source: Cannot continue without LOG_LEVEL.
hu: Nem folytatható LOG_LEVEL nélkül.

source: Option -${__gl_tmp_opt_short}${__gl_tmp_opt_long:-} requires an argument
hu: A(z) -${__gl_tmp_opt_short}${__gl_tmp_opt_long:-} kapcsolónak argumentum megadása szükséges

source: Cleaning up. Done
hu: Takarítás. Kész

source: Error in ${__gl_file} in function ${function} on line ${line}
hu: Hiba a ${__gl_file} fájl ${function} funkciójában a ${line}. sorban
