Repository: krisztianmukli/bash3boilerplate
Catalog: locale/*/LC_MESSAGES/script_remove.po
Languages: hu

source: Available arguments: -s --script [scriptfile] Remove specified scriptfile and it's localization and payloads. Required. -l --with-libraries Remove specified scriptfile and it's libraries, if any -D --with-dependencies Remove specified scriptfile and it's dependencies -d --debug Enables debug mode -f --force Force remove commands -h --help This page -n --no-color Disable color output -v Enable verbose mode, print script as it is executed -V --version Display version and license information
hu: Használható argumentumok: -s --script [scriptfile] Eltávolítja a megadott szkriptfájlt, a lokalizációs fájljait és csatolt fájljait. Kötelező. -l --with-libraries Programkönyvtáraival együtt távolítja el a megadott szkriptfájlt. -D --with-dependencies Függőségeivel együtt távolítja el a megadott szkriptfájlt -d --debug Hibakeresési mód engedélyezése -f --force Eltávolítási utasítások erőltetése -h --help Súgó -n --no-color Színes kimenet kikapcsolása -v Részletes mód engedélyezése, kiíratja a szkriptet futás közben -V --version Verzió és licencinformációk megjelenítése

source: This command can uninstall bash-script and it's dependencies from a specified folder, using script own ini file. It is part of BASH3 Boilerplate by krisztianmukli project.
hu: Eltávolítja a megadott szkriptet és függőségeit a megadott mappából, annak saját .ini-fájlját használva. A BASH3 Boilerplate by krisztianmukli projekt része.

source: Default
hu: Alapértelmezett

source: Required
hu: Kötelező

source: Standalone script uninstaller
hu: Önálló szkript eltávolító

source: Licensed under the MIT license
hu: MIT licensz alatt kiadva

source: Starting package-remove
hu: Csomageltávolítás indítása

source: Removing of following dependencies was succesful: ${dependencies}
hu: A következő csomagok eltávolítása sikeres: ${dependencies}

source: No valid packages
hu: Nincs érvényes csomag

source: You need higher privileges for removing packages!
hu: Magasabb jogosultságokra van szükség a csomag-eltávolításhoz!

source: For removing following packages in macOS, you must use Homebrew or Macports: ${dependencies}
hu: A következő csomagok eltávolításához macOS alatt a HomeBrew vagy a Macports szükséges: ${dependencies}

source: Removing following packages from shell in cygwin, must be use apt-cyg, or install them with Cygwin setup.exe: ${dependencies}
hu: A következő csomagok eltávolításához a rendszerhéjból cygwin alatt, szükség van az apt-cyg parancsra, vagy használja a Cygwin setup.exe-jét: ${dependencies}

source: Unknown or unsupported operating system, cannot remove following packages: ${dependencies}
hu: Ismeretlen vagy nem támogatott operációs rendszer, nem lehet eltávolítani a következő csomagokat: ${dependencies}

source: Unknown error during removing packages!
hu: Ismeretlen hiba a csomagok eltávolítása közben!

source: Finished the package-removing
hu: Csomag-eltávolítás kész

source: Assuming local install, trying to user's PATH
hu: Helyi telepítés feltételezése, a felhasználó PATH változójának használata

source: Targetdir, where installed script were: ${targetdir}
hu: Célkönyvtár, ahol a telepített szkript található: ${targetdir}

source: Removing script unsuccessful: ${targetdir} is not exists!
hu: Szkript eltávolítása sikertelen: ${targetdir} nem létezik!

source: Removing script unsuccessful: ${targetdir} is not writable! It may need higher privileges.
hu: Szkript eltávolítása sikertelen: ${targetdir} nem írható! Lehetséges, hogy magasabb jogosultságok szükségesek.

source: Removing script was unsuccessful: unsupported filename ($script)
hu: Szkript eltávolítása sikertelen: nem támogatott fájlnév ($script)

source: Removing script was unsuccessful: there was an error during removing file ${script}
hu: Szkript eltávolítása sikertelen: hiba történt a ${script} törlése közben

source: Removing unsuccessful: there was an error during removing files
hu: Szkript eltávolítása sikertelen: hiba történt a fájlok törlése közben

source: Removing file ${targetdir}/${script} was success
hu: A(z) ${targetdir}/${script} fájl eltávolítása sikeres

source: Removing payloads was unsuccessful: unsupported filename (${payload})
hu: Csatolt fájlok eltávolítása sikertelen: nem támogatott fájlnév (${payload})

source: Removing payloads was unsuccessful: there was an error during removing files: ${targetdir}/${payload}
hu: Csatolt fájlok eltávolítása sikertelen: hiba történt a fájlok törlése közben: ${targetdir}/${payload}

source: The file ${sourcedir}/${payload} was succesfully removed.
hu: A(z) ${sourcedir}/${payload} sikeresen eltávolítva.

source: Removing libraries was unsuccessful: unsupported filename ($lib)
hu: Programkönyvtárak eltávolítása sikertelen: nem támogatott fájlnév: ($lib)

source: Removing libraries was unsuccessful: there was an error during removing files ${libtargetdir}/${lib}
hu: Programkönyvtárak eltávolítása sikertelen: hiba történ a ${libtargetdir}/${lib} fájl törlésekor

source: Removing libraries was unsuccessful: there was an error during removing files
hu: Programkönyvtárak eltávolítása sikertelen: hiba történt a fájlok törlése közben

source: Removing file ${targetdir}/lib/${lib} was succesful
hu: A(z) ${targetdir}/lib/${lib} fájl eltávolítása sikeres

source: Script use the following packages as dependencies: ${dependencies}.\nWould you like to remove them? It can effect to other softwares, don't do it if you don't understand!
hu: A megadott szkript a következő csomagokat használja függőségként: ${dependencies}.\nSzeretné eltávolítani őket? Ez hatással lehet más szoftverek működésére is, ne tegye ha nem tudja mit csinál!

source: Removing dependencies: ${dependencies}
hu: Függőségek eltávolítása: ${dependencies}

source: Removing packages unsuccessful: there was an error during removing dependencies
hu: Csomagok eltávolítása sikertelen: hiba történt a csomagok eltávolítása közben

source: Removing script was success.
hu: Szkript eltávolítása sikeres.

source: Script is unavailable or doesn't exists!
hu: A szkript nem elérhető vagy nem létezik!

source: Invalid use of script: ${__sr_tmp_params}
hu: Szkript érvénytelen használata: ${__sr_tmp_params}

source: Help using ${__sr_base}
hu: ${__sr_base} súgó

source: Setting a filename with -s or --source is required
hu: Fájlnév megadása a -s vagy --source kapcsolóval szükséges

source: Cannot continue without LOG_LEVEL.
hu: Nem folytatható LOG_LEVEL nélkül.

source: Option -${__sr_tmp_opt_short}${__sr_tmp_opt_long:-} requires an argument
hu: A(z) -${__sr_tmp_opt_short}${__sr_tmp_opt_long:-} kapcsolónak argumentum megadása szükséges

source: Cleaning up. Done
hu: Takarítás. Kész

source: Error in ${__sr_file} in function ${function} on line ${line}
hu: Hiba a ${__sr_file} fájl ${function} funkciójában a ${line}. sorban
