Repository: krisztianmukli/bash3boilerplate
Catalog: locale/*/LC_MESSAGES/script_install.po
Languages: hu

source: Available arguments: -c --check-dependencies Check dependencies of specified script -d --debug Enables debug mode -f --force Forcing commands (e.g. overwrite existing files) -h --help This page -i --ini [inifile] Ini-file using the installation. If not set, installer use [sourcedir]/install.ini -n --no-color Disable color output -s --source [sourcedir] Source dir of script. Default="$__si_act_dir" -t --target [targetdir] Target directory. Default=system-wide You can use following abbreviations, or specify explicit target: * 'sys', 'system' or 'system-wide' for /usr/local/bin (/usr/local/share/locale for localization) * 'usr', 'user' or 'user-wide' for ~/.local/bin (~/.local/share/locale for localization) If specify explicit targetdir, script libraries and locale will install to that folder. Optional, if not specified, script assumes system-wide installation, fallback to user-wide if user hasn't root permission. -v Enable verbose mode, print script as it is executed -V --version Display version and license information
hu: Használható argumentumok: -c --check-dependencies Ellenőrzi a megadott szkript függőségeit -d --debug Hibakeresési mód engedélyezése -f --force Utasítások erőltetése (pl. fájlok felülírásánál) -h --help Súgó -i --ini [inifile] Telepítéshez használt .ini-fájl. Ha nincs megadva a telepítő a [sourcedir]/install.ini -t használja. -n --no-color Színes kimenet kikapcsolása -s --source [sourcedir] Szkript forráskönyvtára. Alapértelmezett="$__si_act_dir" -t --target [targetdir] Célkönyvtár. Alapértelmezett=system-wide Megadhatja a következő rövidítéseket, vagy közvetlen elérési utat: * 'sys', 'system' vagy 'system-wide' esetén a /usr/local/bin (/usr/local/share/locale a lokalizációhoz) lesz használva a telepítéshez * 'usr', 'user' vagy 'user-wide' a ~/.local/bin (~/.local/share/locale a lokalizációhoz) lesz használva a telepítéshez Ha közvetlen elérési utat ad meg, akkor a szkript, a programkönyvtárak és a lokalizációs fájlok is oda települnek Opcionális, ha nincs megadva a szkript rendszerszintű telepítést feltételez rendszergazdai jogok hiánya esetén a felhasználó könyvtárába telepít. -v Részletes mód engedélyezése, kiíratja a szkriptet futás közben -V --version Verzió és licencinformációk megjelenítése

source: This command can install bash-script and it's dependencies from a specified folder, using install.ini file. It is part of BASH3 Boilerplate by krisztianmukli project.
hu: Telepíti a megadott könyvtárból a bash-szkripteket, az install.ini fájl használatával. A BASH3 Boilerplate by krisztianmukli projekt része.

source: Default
hu: Alapértelmezett

source: Required
hu: Kötelező

source: Standalone script installer
hu: Önálló szkript telepítő

source: Licensed under the MIT license
hu: MIT licensz alatt kiadva

source: Starting package-installation
hu: Csomagtelepítés indítása

source: Installation of following dependencies was succesful: ${missingpkgs}
hu: A következő függőségek telepítése sikeres: ${missingpkgs}

source: No valid packages
hu: Nincs érvényes csomag

source: You need higher privileges for installing packages!
hu: Magasabb jogosultságokra van szükség a csomagok telepítéséhez!

source: For installing following packages in macOS, you must use Homebrew or Macports: ${missingpkgs}
hu: A következő csomagok telepítéséhez macOS alatt a HomeBrew vagy a Macports szükséges: ${missingpkgs}

source: Install the following packages from shell in cygwin, must be use apt-cyg, or install them with Cygwin setup.exe: ${missingpkgs}
hu: A következő csomagok telepítéséhez a rendszerhéjból cygwin alatt, szükség van az apt-cyg parancsra, vagy használhatja a Cygwin setup.exe-jét: ${missingpkgs}

source: Unknown or unsupported operating system, cannot install following packages: ${missingpkgs}
hu: Ismeretlen vagy nem támogatott operációs rendszer, nem lehet telepíteni a következő csomagokat: ${missingpkgs}

source: Unknown error during installing packages!
hu: Ismeretlen hiba csomagtelepítés közben!

source: Finished the package-installation
hu: Csomagtelepítés kész

source: Installation unsuccessful: ${sourcedir} is not exists!
hu: Telepítés sikertelen: ${sourcedir} nem létezik!

source: Installation unsuccessful: can not create ${targetdir}
hu: Telepítés sikertelen: nem lehet létrehozni a(z) ${targetdir} mappát

source: Installation unsuccessful: ${targetdir} not writable
hu: Telepítés sikertelen: ${targetdir} nem írható

source: Installation unsuccessful: ${libsourcedir} is not exists!
hu: Telepítés sikertelen: ${libsourcedir} nem létezik!

source: Installation unsuccessful: can not create ${libtargetdir}
hu: Telepítés sikertelen: Nem lehet létrehozni a(z) ${libtargetdir} mappát

source: Installation unsuccessful: ${libtargetdir} not writable
hu: Telepítés sikertelen: ${libtargetdir} nem írható

source: Installation unsuccessful: can not create ${localetargetdir}
hu: Telepítés sikertelen: nem lehet létrehozni a(z) ${localetargetdir} mappát

source: Installation unsuccessful: ${localetargetdir} not writable
hu: Telepítés sikertelen: ${localetargetdir} nem írható

source: Installation unsuccessful: unsupported filename (${script})
hu: Telepítés sikertelen: nem támogatott fájlnév (${script})

source: Installation unsuccessful: there was an error during copying files
hu: Telepítés sikertelen: hiba történt a fájlok másolása közben

source: Set executable permission was unsuccessful for file ${targetdir}/${script}! Maybe it need higher privileges!
hu: Futtatási jogok beállítása sikertelen a ${targetdir}/${script} fájlra! Lehetséges, hogy magasabb jogosultságok szükségesek!

source: Installation file ${script} was succesful to ${targetdir}
hu: A(z) ${script} telepítése a(z) ${targetdir} mappába sikeres

source: Installation unsuccessful: unsupported filename ($lib)
hu: Telepítés sikertelen: nem támogatott fájlnév ($lib)

source: Installation file ${lib} was succesful to ${libtargetdir}
hu: A(z) ${lib} telepítése a(z) ${libtargetdir} mappába sikeres

source: Installation unsuccessful: unsupported filename (${payload})
hu: Telepítés sikertelen: nem támogatott fájlnév (${payload})

source: Missing dependencies: ${missingpkgs}
hu: Hiányzó függőségek: ${missingpkgs}

source: Installation unsuccessful: there was an error during installing dependencies
hu: Telepítés sikertelen: hiba történt a függőségek telepítése során

source: Installation files was succesful to ${targetdir}
hu: Fájlok sikeresen telepítve a(z) ${targetdir} mappába

source: ~/.profile was updated, please login again or run 'source ~/.profile' command to reload PATH variable!
hu: A ~/.profile fájl módosításra került, jelentkezzen be újra, vagy futassa a 'source ~/.profile' utasítást a PATH környezeti változó értékének frissítéséhez!

source: Following packages are missing: ${missingpkgs}, would you like to install them?
hu: A következő csomagok hiányoznak: ${missingpkgs}, szeretné telepíteni őket?

source: Unsupported operating system. Installation is not possible.
hu: Nem támogatott operációs rendszer. A telepítés nem lehetséges.

source: Install script manually: * Copy the script and the lib folder to your PATH. * Copy to locale folder to your locale folder. * Install dependencies.
hu: Szkript telepítése manuálisan: *Másolja le a szkriptet és 'lib' mappa tartalmát egy a PATH környezeti változóban megtalálható mappába. * * Másolja le a 'locale' mappa tartalmát a lokalizációs fájlok helyére. *Telepítse a függőségeket.

source: User's home dir: ${__si_user_home}
hu: Felhasználó mappája: ${__si_user_home}

source: Source dir: ${sourcedir}
hu: Forrásmappa: ${sourcedir}

source: Defined target dir: ${defined_targetdir}
hu: Megadott célkönyvtár: ${defined_targetdir}

source: Target directory, to the script will install: ${targetdir}
hu: Célkönyvtár, ahova a szkript telepítésre kerül: ${targetdir}

source: Target directory, which is added to ~/.profile file: ${targetdirtext}
hu: Célkönyvtár, ami hozzáadásra kerül a ~/.profile fájlhoz: ${targetdirtext}

source: Target directory for locale files: ${localedir}
hu: Célkönyvtár a lokalizációs fájloknak: ${localedir}

source: Ini-file: ${inifile}
hu: Ini-fájl: ${inifile}

source: Invalid use of script: ${__si_tmp_params}
hu: Szkript érvénytelen használata: ${__si_tmp_params}

source: Help using ${__si_base}
hu: ${__si_base} súgó

source: Cannot continue without LOG_LEVEL.
hu: Nem folytatható LOG_LEVEL nélkül.

source: Option -${__si_tmp_fullopt} requires an argument
hu: A(z) -${__si_tmp_fullopt} kapcsolónak argumentum megadása szükséges

source: Cleaning up. Done
hu: Takarítás. Kész

source: Error in ${__si_file} in function ${function} on line ${line}
hu: Hiba a ${__si_file} fájl ${function} funkciójában a ${line}. sorban
