Repository: krisztianmukli/bash3boilerplate
Catalog: INSTALLER/share/locale/*/LC_MESSAGES/b3bp.po
Languages: hu

source: Available arguments: -f --file [arg] Filename to process. Required. -t --temp [arg] Location of tempfile. Default="/tmp/bar" -v Enable verbose mode, print script as it is executed -d --debug Enables debug mode -h --help This page -n --no-color Disable color output -1 --one Do just one thing -V --version Display version and license information
hu: Használható argumentumok: -f --file [arg] Feldolgozandó fájlnév. Kötelező. -t --temp [arg] Ideiglenes fájlok helye. Alapértelmezett=\"/tmp/bar\" -v Részletes mód engedélyezése, kiíratja a szkriptet futás közben -d --debug Hibakeresési mód engedélyezése -h --help Súgó -n --no-color Színes kimenet kikapcsolása -1 --one Csak egy dolgot csinál -V --version Verzió és licencinformációk megjelenítése

source: This is Bash3 Boilerplates help text. Feel free to add any description of your program or elaborate more on command-line arguments. This section is not parsed and will be added as-is to the help.
hu: Ez a Bash3 Boilerplate súgószövege. Szabadon hozzáadhat bármilyen leírást a programhoz, vagy kifejtheti a parancssoros argumentumokat. Ez a szöveg nem kerül feldolgozásra, úgy adódik hozzá a súgóhoz, ahogy megadod.

source: Default
hu: Alapértelmezett

source: Required
hu: Kötelező

source: Licensed under the MIT license
hu: MIT licensz alatt kiadva

source: Demo and test of the Bash-script template
hu: Demó és a Bash-szkript sablon tesztelése

source: multiple lines example - line #1\nmultiple lines example - line #2\nimagine logging the output of 'ls -al /path/'
hu: többsoros példa - #1. sor\ntöbbsoros példa - #2. sor\nképzelje el, hogy naplózhatja az 'ls -al /path/ kimenetét'

source: Info useful to developers for debugging the application, not useful during operations.
hu: Hasznos információk a fejlesztőknek az alkalmazás hibakeresése során, de nem szükséges normál működés közben.

source: Normal operational messages - may be harvested for reporting, measuring throughput, etc. - no action required.
hu: Normál működés üzenetei - használható jelentéskészítéshez, átvitel méréséhez, stb. - nem szükséges művelet.

source: Events that are unusual but not error conditions - might be summarized in an email to developers or admins to spot potential problems - no immediate action required.
hu: Szokatlan események, melyek nem hibák - összegezhetőek és elküldhetőek e-mailben a fejlesztőknek vagy a rendszergazdának a lehetséges problémák felismeréséhez - azonnali művelet nem szükséges.

source: Warning messages, not an error, but indication that an error will occur if action is not taken, e.g. file system 85% full - each item must be resolved within a given time. This is a debug message
hu: Figyelmeztető üzenetek, amelyek nem hibák, de hibákhoz vezethetnek ha nem intézkednek, pl. fájlrendszer 85%-a foglalt - minden esetet meg kell oldani adott időn belül. Ez egy hibakeresési üzenet

source: Non-urgent failures, these should be relayed to developers or admins; each item must be resolved within a given time.
hu: Nem sürgős hibák, ezeket továbbítani kell a fejlesztőknek vagy a rendszergazdáknak; minden egyes esetet meg kell oldani adott időn belül.

source: Should be corrected immediately, but indicates failure in a primary system, an example is a loss of a backup ISP connection.
hu: Azonnal javítani kell, az elsődleges rendszer hibájára utal, például a biztonsági ISP-kapcsolat elvesztésére.

source: Should be corrected immediately, therefore notify staff who can fix the problem. An example would be the loss of a primary ISP connection.
hu: Azonnal javítani kell, ezért figyelmeztetni kell a személyzetet, hogy kijavíthassák a problémát. Például ilyen az elsődleges ISP kapcsolat elvesztése.

source: A \"panic\" condition usually affecting multiple apps/servers/sites. At this level it would usually notify all tech staff on call.
hu: \"Végzetes\" helyzet ami rendszerint több alkalmazás/szerver/oldal hibájára lehet hatással. Ezen a szinten a teljes technikai személyzetet hívni kell.

source: Press any key to continue
hu: A folytatáshoz nyomjon meg egy billentyűt

source: Invalid use of script: ${__b3bp_tmp_params}
hu: Szkript érvénytelen használata: ${__b3bp_tmp_params}

source: Help using ${__b3bp_base}
hu: ${__b3bp_base} súgó

source: Setting a filename with -f or --file is required
hu: Fájlnév megadása a -f vagy --file kapcsolóval szükséges

source: Cannot continue without LOG_LEVEL.
hu: Nem folytatható LOG_LEVEL nélkül.

source: Option -${__b3bp_tmp_opt_short}${__b3bp_tmp_opt_long:-} requires an argument
hu: A(z) -${__b3bp_tmp_opt_short}${__b3bp_tmp_opt_long:-} kapcsolónak argumentum megadása szükséges

source: Could not create temporary directory! Exiting.
hu: Nem lehet ideiglenes könyvtárat létrehozni! Kilépés.

source: Cleaning up. Done
hu: Takarítás. Kész

source: Error in ${__b3bp_file} in function ${function} on line ${line}
hu: Hiba a ${__b3bp_file} fájl ${function} funkciójában a ${line}. sorban
